MusicApp/app/controllers/albums_controller.rb

    def new
        @album = Album.new
        @band_id = params[:band_id]
        @bands = Band.all
---
SELECT "bands".* FROM "bands"